---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewModelDisplayMode
source: html/3733a679-795a-901f-fd8e-e5f7c2c06860.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewModelDisplayMode Property

"Display Model"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewModelDisplayMode { get; }
```